# Файл: gui/modbus_table.py
# Здесь хранятся ТОЛЬКО карты регистров приборов. Весь графический код PyQt6 удален.

MKB4_STATIC_REGISTERS = {
    0x0000: {"Параметр": "Состояние МКБ4 (код аварии)", "Масштаб": 1, "знак": False},
    0x0001: {"Параметр": "Напряжение первого элемента АКБ, В", "Масштаб": 10, "знак": False},
    0x0002: {"Параметр": "Напряжение второго элемента АКБ, В", "Масштаб": 10, "знак": False},
    0x0003: {"Параметр": "Напряжение третьего элемента АКБ, В", "Масштаб": 10, "знак": False},
    0x0004: {"Параметр": "Напряжение четвертого элемента АКБ, В", "Масштаб": 10, "знак": False},
    0x0005: {"Параметр": "Температура группы АКБ, °С", "Масштаб": 10, "знак": True},
    0x0006: {"Параметр": "Корректирующий множитель k1 (U1)", "Масштаб": 100, "знак": False},
    0x0007: {"Параметр": "Корректирующий множитель k2 (U2)", "Масштаб": 100, "знак": False},
    0x0008: {"Параметр": "Корректирующий множитель k3 (U3)", "Масштаб": 100, "знак": False},
    0x0009: {"Параметр": "Корректирующий множитель k4 (U4)", "Масштаб": 100, "знак": False},
    0x000A: {"Параметр": "Корректирующий множитель k5 (Temp)", "Масштаб": 1, "знак": False},
    0x000B: {"Параметр": "UАЦП1мин", "Масштаб": 100, "знак": False},
    0x000C: {"Параметр": "UАЦП2мин", "Масштаб": 100, "знак": False},
    0x000D: {"Параметр": "UАЦП3мин", "Масштаб": 100, "знак": False},
    0x000E: {"Параметр": "UАЦП4мин", "Масштаб": 100, "знак": False},
    0x000F: {"Параметр": "Управляющая команда", "Масштаб": 1, "знак": False},
    0x0010: {"Параметр": "Минимальное значение напряжения 1-го элемента, В", "Масштаб": 100, "знак": True},
    0x0011: {"Параметр": "Минимальное значение напряжения 2-го элемента, В", "Масштаб": 100, "знак": True},
    0x0012: {"Параметр": "Минимальное значение напряжения 3-го элемента, В", "Масштаб": 100, "знак": True},
    0x0013: {"Параметр": "Минимальное значение напряжения 4-го элемента, В", "Масштаб": 100, "знак": True},
    0x0014: {"Параметр": "±, 0С", "Масштаб": 100, "знак": True},
    0x0015: {"Параметр": "Текущее U АЦП канала измерения U1", "Масштаб": 100, "знак": False},
    0x0016: {"Параметр": "Текущее U АЦП канала измерения U2", "Масштаб": 100, "знак": False},
    0x0017: {"Параметр": "Текущее U АЦП канала измерения U3", "Масштаб": 100, "знак": False},
    0x0018: {"Параметр": "Текущее U АЦП канала измерения U4", "Масштаб": 100, "знак": False},
    0x0019: {"Параметр": "Текущее U АЦП канала измерения Temp", "Масштаб": 100, "знак": False},
    0x001A: {"Параметр": "Адрес МКБ4", "Масштаб": 1, "знак": False},
    0x001B: {"Параметр": "Номер версии конфигурации калибровочных коэф.", "Масштаб": 1, "знак": False}
}

MK3_STATIC_REGISTERS = {
    0x0000: {"Параметр": "Состояние МК3 (код аварии)", "Масштаб": 1, "знак": False},
    0x0001: {"Параметр": "Напряжение АКБ, В", "Масштаб": 10, "знак": False},
    0x0002: {"Параметр": "Состояние LVD1 (BLVD) (0-разомкнут; 1-замкнут)", "Масштаб": 1, "знак": False},
    0x0003: {"Параметр": "Состояние LVD2 (0-разомкнут; 1-замкнут)", "Масштаб": 1, "знак": False},
    0x0004: {"Параметр": "Состояние LVD3 (0-разомкнут; 1-замкнут)", "Масштаб": 1, "знак": False},
    0x0005: {"Параметр": "Напряжение отключения контактора АКБ, В", "Масштаб": 10, "знак": False},
    0x0006: {"Параметр": "Напряжение обратного включения контактора АКБ, В", "Масштаб": 10, "знак": False},
    0x0007: {"Параметр": "Корректирующий множитель k канала измерения напряжения АКБ", "Масштаб": 100, "знак": False},
    0x0008: {"Параметр": "dY, B", "Масштаб": 1000, "знак": False},
    0x0009: {"Параметр": "Минимальное значение напряжения канала измерения напряжения АКБ UАЦПмин, В", "Масштаб": 1000, "знак": False},
    0x000A: {"Параметр": "Длительность импульса включения/выключения контактора, мс", "Масштаб": 1, "знак": False},
    0x000B: {"Параметр": "Тип контактора LVD1 (BLVD) (0-отсутствует; 1-моностабильный; 2-бистабильный)", "Масштаб": 1, "знак": False},
    0x000C: {"Параметр": "Тип контактора LVD2 (0-отсутствует; 1-моностабильный; 2-бистабильный)", "Масштаб": 1, "знак": False},
    0x000D: {"Параметр": "Тип контактора LVD3 (0-отсутствует; 1-моностабильный; 2-бистабильный)", "Масштаб": 1, "знак": False},
    0x000E: {"Параметр": "Текущее напряжение на входе АЦП канала измерения напряжения первого элемента АКБ, В", "Масштаб": 1000, "знак": False},
    0x000F: {"Параметр": "Управляющая команда", "Масштаб": 1, "знак": False},
    0x0010: {"Параметр": "Адрес МК3", "Масштаб": 1, "знак": False},
    0x0011: {"Параметр": "Номер версии конфигурации калибровочных коэффициентов", "Масштаб": 1, "знак": False}
}


MITN300_STATIC_REGISTERS = {
    0x0000: {"Параметр": "Состояние МИТН300 (код аварии)", "Масштаб": 1, "знак": False},
    0x0001: {"Параметр": "Напряжение на шине ЗВУ, В", "Масштаб": 100, "знак": False},
    0x0002: {"Параметр": "Ток нагрузки, А", "Масштаб": 100, "знак": False},
    0x0003: {"Параметр": "Признак наличия пульсаций (0-нет, 1-есть)", "Масштаб": 1, "знак": False},
    0x0004: {"Параметр": "Текущий уровень пульсаций, %", "Масштаб": 1, "знак": False},
    0x0005: {"Параметр": "Корректирующий множитель k1 канала измерения напряжения на шине ЗВУ", "Масштаб": 10, "знак": False},
    0x0006: {"Параметр": "Корректирующий множитель k2 канала измерения тока на шине нагрузки ЗВУ", "Масштаб": 10, "знак": False},
    0x0007: {"Параметр": "UАЦПмин", "Масштаб": 100, "знак": False},
    0x0008: {"Параметр": "UАЦПмах", "Масштаб": 100, "знак": False},
    0x0009: {"Параметр": "IАЦПмин", "Масштаб": 100, "знак": False},
    0x000A: {"Параметр": "IАЦПмах", "Масштаб": 100, "знак": False},
    0x000B: {"Параметр": "Резерв", "Масштаб": 100, "знак": False},
    0x000C: {"Параметр": "Минимальный уровень пульсаций, В", "Масштаб": 100, "знак": False},
    0x000D: {"Параметр": "Номинальное напряжение шунта, мВ", "Масштаб": 1, "знак": False},
    0x000E: {"Параметр": "Номинальный ток шунта, А", "Масштаб": 1, "знак": False},
    0x000F: {"Параметр": "Управляющая команда", "Масштаб": 1, "знак": False},
    0x0010: {"Параметр": "Текущее напряжение на входе АЦП канала измерения напряжения", "Масштаб": 100, "знак": False},
    0x0011: {"Параметр": "Текущее напряжение на входе АЦП канала измерения тока", "Масштаб": 100, "знак": False},
    0x0012: {"Параметр": "Адрес МИТН300", "Масштаб": 1, "знак": False}
}

MITB300_STATIC_REGISTERS = {
    0x0000: {"Параметр": "Состояние МИТБ300 (код аварии)", "Масштаб": 1, "знак": False},
    0x0001: {"Параметр": "Напряжение АКБ, В", "Масштаб": 100, "знак": False},
    0x0002: {"Параметр": "Ток АКБ, А", "Масштаб": 100, "знак": False},
    0x0003: {"Параметр": "Амплитуда переменного напряжения на шине АКБ, В", "Масштаб": 10, "знак": False},
    0x0004: {"Параметр": "Направление тока (0-заряд (+), 1-разряд (-))", "Масштаб": 1, "знак": False},
    0x0005: {"Параметр": "Корректирующий множитель k1 канала измерения напряжения на шине АКБ", "Масштаб": 100, "знак": False},
    0x0006: {"Параметр": "Корректирующий множитель k2m канала измерения тока разряда АКБ", "Масштаб": 100, "знак": False},
    0x0007: {"Параметр": "Корректирующий множитель k2p канала измерения тока заряда АКБ", "Масштаб": 100, "знак": False},
    0x0008: {"Параметр": "dY1 – аддитивный коэффициент канала измерения напряжения на шине АКБ", "Масштаб": 100, "знак": False},
    0x0009: {"Параметр": "dY2m – аддитивный коэффициент канала измерения тока разряда АКБ", "Масштаб": 100, "знак": False},
    0x000A: {"Параметр": "dY2p – аддитивный коэффициент канала измерения тока заряда АКБ", "Масштаб": 100, "знак": False},
    0x000B: {"Параметр": "UАКБмин", "Масштаб": 100, "знак": False},
    0x000C: {"Параметр": "IАЦП_0m", "Масштаб": 100, "знак": False},
    0x000D: {"Параметр": "IАЦП_0p", "Масштаб": 100, "знак": False},
    0x000E: {"Параметр": "Минимальный уровень пульсаций, В", "Масштаб": 10, "знак": False},
    0x000F: {"Параметр": "Управляющая команда", "Масштаб": 1, "знак": False},
    0x0010: {"Параметр": "Номинальное напряжение шунта, мВ", "Масштаб": 1, "знак": False},
    0x0011: {"Параметр": "Номинальный ток шунта, А", "Масштаб": 1, "знак": False},
    0x0012: {"Параметр": "Резерв", "Масштаб": 1, "знак": False},
    0x0013: {"Параметр": "Текущее напряжение на входе АЦП канала измерения напряжения", "Масштаб": 100, "знак": False},
    0x0014: {"Параметр": "Текущее напряжение на входе АЦП канала измерения тока", "Масштаб": 100, "знак": False},
    0x0015: {"Параметр": "Номер версии конфигурации", "Масштаб": 1, "знак": False},
    0x0016: {"Параметр": "Адрес МИТБ300", "Масштаб": 1, "знак": False}
}

MVV8_STATIC_REGISTERS = {
    0x0000: {"Параметр": "Состояние МВВ8(16) (код аварии)", "Масштаб": 1, "знак": False},
    0x0001: {"Параметр": "Напряжение на входе канала АЦП U0_10 B, В", "Масштаб": 100, "знак": False},
    0x0002: {"Параметр": "Напряжение на входе канала АЦП I4_20 mA, В", "Масштаб": 100, "знак": False},
    0x0003: {"Параметр": "Аналоговый сигнал U0_10, %", "Масштаб": 1, "знак": False},
    0x0004: {"Параметр": "Аналоговый сигнал I4_20, %", "Масштаб": 1, "знак": False},
    0x0005: {"Параметр": "Слово состояния 8 (16) входов InWord", "Масштаб": 1, "знак": False},
    0x0006: {"Параметр": "Слово состояния релейных выходов OutWord", "Масштаб": 1, "знак": False},
    0x0007: {"Параметр": "Корректирующий множитель k1 канала U0_10 B", "Масштаб": 1000, "знак": False},
    0x0008: {"Параметр": "Корректирующий множитель k2 канала I4_20 mA", "Масштаб": 1000, "знак": False},
    0x0009: {"Параметр": "U0_10 min, В", "Масштаб": 100, "знак": False},
    0x000A: {"Параметр": "U0_10 max, В", "Масштаб": 100, "знак": False},
    0x000B: {"Параметр": "I 4_20 min, В", "Масштаб": 100, "знак": False},
    0x000C: {"Параметр": "I 4_20 max, В", "Масштаб": 100, "знак": False},
    0x000D: {"Параметр": "Резерв", "Масштаб": 1, "знак": False},
    0x000E: {"Параметр": "Адрес МВВ", "Масштаб": 1, "знак": False},
    0x000F: {"Параметр": "Управляющая команда", "Масштаб": 1, "знак": False}
}


MVN400_STATIC_REGISTERS = {
    0x0000: {"Параметр": "Состояние МВН400 (код аварии)", "Масштаб": 1, "знак": False},
    0x0001: {"Параметр": "Напряжение на входе канала АЦП U0_10 B, В", "Масштаб": 100, "знак": False},
    0x0002: {"Параметр": "Напряжение на входе канала АЦП I4_20 mA, В", "Масштаб": 100, "знак": False},
    0x0003: {"Параметр": "Аналоговый сигнал U0_10, %", "Масштаб": 1, "знак": False},
    0x0004: {"Параметр": "Аналоговый сигнал I4_20, %", "Масштаб": 1, "знак": False},
    0x0005: {"Параметр": "Слово состояния 8 (16) входов InWord", "Масштаб": 1, "знак": False},
    0x0006: {"Параметр": "Слово состояния релейных выходов OutWord", "Масштаб": 1, "знак": False},
    0x0007: {"Параметр": "Корректирующий множитель k1 канала U0_10 B", "Масштаб": 1000, "знак": False},
    0x0008: {"Параметр": "Корректирующий множитель k2 канала I4_20 mA", "Масштаб": 1000, "знак": False},
    0x0009: {"Параметр": "U0_10 min, В", "Масштаб": 100, "знак": False},
    0x000A: {"Параметр": "U0_10 max, В", "Масштаб": 100, "знак": False},
    0x000B: {"Параметр": "I 4_20 min, В", "Масштаб": 100, "знак": False},
    0x000C: {"Параметр": "I 4_20 max, В", "Масштаб": 100, "знак": False},
    0x000D: {"Параметр": "Резерв", "Масштаб": 1, "знак": False},
    0x000E: {"Параметр": "Адрес МВН400", "Масштаб": 1, "знак": False},
    0x000F: {"Параметр": "Управляющая команда", "Масштаб": 1, "знак": False}
}

DEVICE_MAPS = {
    17: MKB4_STATIC_REGISTERS,    
    81: MK3_STATIC_REGISTERS,   
    49: MITN300_STATIC_REGISTERS,#????
    # 49: MITN300_STATIC_REGISTERS,
    97: MVV8_STATIC_REGISTERS,
    # 97: MVN400_STATIC_REGISTERS
}